Repository: xmqywx/CodeLight
Catalog: app/CodeLight/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: About
zh_hans: 关于

# about_footer
source: CodeLight — Monitor and control Claude Code from your iPhone. Made with passion by the CodeIsland team.
zh_hans: CodeLight — 从 iPhone 监控和操作 Claude Code。 由 CodeIsland 团队倾力打造。

source: Actions
zh_hans: 操作

source: Active
zh_hans: 活跃

# active_status
source: Active
zh_hans: 活跃

# add_server_instruction
source: Tap + to add a server by scanning a QR code or entering a URL.
zh_hans: 点击 + 扫描二维码或输入 URL 来添加服务器。

source: Allow
zh_hans: 允许

source: Archive
zh_hans: 归档

# archive_hint
source: Swipe a session left to archive it. Archived sessions live here so you only see what you care about in the main list.
zh_hans: 在主列表里左滑会话即可归档。归档后的会话集中在这里，主列表只显示你关注的会话。

source: Archived
zh_hans: 已归档

# camera_not_available
source: Camera not available on this device
zh_hans: 此设备无法使用相机

source: Cancel
zh_hans: 取消

source: Choose from Library
zh_hans: 从相册选择

source: Clean Now
zh_hans: 立即清理

# cleaning_ellipsis
source: Cleaning…
zh_hans: 正在清理…

# cleanup_confirm_message
source: This will mark sessions with no activity in the last 15 minutes as inactive.
zh_hans: 这将把最近 15 分钟没有活动的会话标记为非活跃。

# cleanup_footer
source: Mark sessions with no activity in the last 15 minutes as inactive on the server.
zh_hans: 将服务器上最近 15 分钟没有活动的会话标记为非活跃。

source: Cleanup Inactive Sessions
zh_hans: 清理非活跃会话

# cleanup_no_sessions
source: No inactive sessions to clean
zh_hans: 没有需要清理的会话

# cleanup_result
source: Cleaned %d session(s)
zh_hans: 已清理 %d 个会话

source: CodeIsland (Mac companion)
zh_hans: CodeIsland (Mac 伴侣应用)

source: Connect
zh_hans: 连接

source: Connected
zh_hans: 已连接

source: Connecting...
zh_hans: 连接中...

source: Connecting to server...
zh_hans: 正在连接服务器...

source: Connection
zh_hans: 连接

source: Connection Failed
zh_hans: 连接失败

# could_not_connect
source: Could not connect to server
zh_hans: 无法连接到服务器

source: Current Server
zh_hans: 当前服务器

source: Custom Path
zh_hans: 自定义路径

source: Delete
zh_hans: 删除

source: Deny
zh_hans: 拒绝

# device_limit_body
source: Your lifetime license is active on another device. Only one device can be connected at a time.
zh_hans: 你的终身授权正在另一台设备上使用。同一时间只能有一台设备连接。

# device_limit_title
source: Device Limit Reached
zh_hans: 设备数量已达上限

source: Device Name
zh_hans: 设备名称

source: Disabled
zh_hans: 已关闭

source: Disconnect & Remove
zh_hans: 断开并移除

source: Disconnected
zh_hans: 未连接

source: Dismiss
zh_hans: 关闭

source: Done
zh_hans: 完成

source: Enable All Notifications
zh_hans: 启用所有通知

source: Enable Notifications
zh_hans: 开启通知

source: Enabled
zh_hans: 已开启

source: Enter Code
zh_hans: 输入代码

source: Enter URL Manually
zh_hans: 手动输入 URL

# inactive_status
source: Inactive
zh_hans: 不活跃

source: Interrupted by user
zh_hans: 被用户中断

source: Invalid QR code
zh_hans: 无效的二维码

source: Jump to Question
zh_hans: 跳转到问题

source: Language
zh_hans: 语言

# language_change_message
source: Your language preference has been saved. CodeLight needs to relaunch to display in the new language.
zh_hans: 语言偏好已保存。CodeLight 需要重启才能应用新语言。

# language_change_title
source: Restart Required
zh_hans: 需要重启

# language_settings_footer
source: Tap to open System Settings → CodeLight → Language. iOS will restart the app with your chosen language automatically.
zh_hans: 点击跳转到系统设置 → CodeLight → 语言。iOS 会自动用所选语言重启 app。

source: Last Active
zh_hans: 上次活跃

source: Launch
zh_hans: 启动

source: Launch on Mac
zh_hans: 在 Mac 上启动

source: Launch Preset
zh_hans: 启动预设

source: Launch Session
zh_hans: 启动会话

# launched_on_mac_format
source: Launched on %@
zh_hans: 已在 %@ 上启动

source: Load earlier messages
zh_hans: 加载更早的消息

# loading_earlier
source: Loading earlier messages...
zh_hans: 正在加载更早的消息...

source: Loading sessions...
zh_hans: 加载会话中...

source: Macs
zh_hans: Mac 列表

source: Manual Entry
zh_hans: 手动输入

# message_placeholder
source: Message...
zh_hans: 输入消息...

source: Mode
zh_hans: 模式

source: Model
zh_hans: 模型

# n_macs_format
source: %d Macs
zh_hans: %d 台 Mac

# n_sessions_format
source: %d sessions
zh_hans: %d 个会话

source: No archived sessions
zh_hans: 没有已归档的会话

source: No paired Macs
zh_hans: 尚未配对任何 Mac

# no_presets_on_mac
source: This Mac has no presets
zh_hans: 这台 Mac 尚未配置预设

source: No recent projects
zh_hans: 暂无最近项目

# no_server_to_connect
source: No server configured
zh_hans: 尚未配置服务器

source: No Servers
zh_hans: 暂无服务器

source: No servers yet
zh_hans: 尚未添加服务器

# no_sessions_instruction
source: Start a Claude Code session on your Mac with CodeIsland running to see it here.
zh_hans: 在 Mac 上启动 Claude Code 会话 并运行 CodeIsland 即可在此查看。

source: No Sessions Yet
zh_hans: 暂无会话

source: Not connected
zh_hans: 未连接

source: Notifications
zh_hans: 通知

# notify_footer
source: Notifications are sent to any iPhone paired with the Mac that owns the session.
zh_hans: 通知会发送到与拥有该会话的 Mac 配对的所有 iPhone。

# notify_on_approval
source: Notify when approval needed
zh_hans: 需要审批时通知

# notify_on_completion
source: Notify when Claude finishes
zh_hans: Claude 完成时通知

# notify_on_error
source: Notify on tool errors
zh_hans: 工具出错时通知

source: OK
zh_hans: 好

# one_session
source: 1 session
zh_hans: 1 个会话

source: Open Chat
zh_hans: 打开聊天

source: Pair
zh_hans: 配对

source: Pair a Mac
zh_hans: 配对 Mac

source: Paired
zh_hans: 已配对

source: Paired Macs
zh_hans: 已配对的 Mac

# paired_with_format
source: Paired with %@
zh_hans: 已与 %@ 配对

source: Pairing…
zh_hans: 配对中…

source: Pairing Code
zh_hans: 配对码

source: Pairing code required
zh_hans: 请输入配对码

source: Path
zh_hans: 路径

# privacy_camera
source: Camera Usage
zh_hans: 相机使用

# privacy_camera_body
source: CodeLight uses your device's camera solely for scanning QR codes during the device pairing process. No images or video are stored or transmitted.
zh_hans: CodeLight 仅在设备配对流程中使用相机扫描二维码，不保存或传输任何图片或视频。

# privacy_contact
source: Contact
zh_hans: 联系方式

# privacy_contact_body
source: Questions about this privacy policy can be sent to xmqywx@gmail.com or filed on GitHub Issues at https://github.com/xmqywx/CodeLight/issues.
zh_hans: 关于隐私政策的问题可发送至 xmqywx@gmail.com，或在 GitHub Issues 提交：https://github.com/xmqywx/CodeLight/issues。

# privacy_data_collection
source: Data Collection
zh_hans: 数据收集

# privacy_data_collection_body
source: CodeLight does not collect, store, or transmit any personal data to third parties. No analytics, no tracking, no advertising.
zh_hans: CodeLight 不会收集、存储或向任何第三方传输个人数据。没有统计分析，没有跟踪，没有广告。

# privacy_data_storage
source: Data Storage
zh_hans: 数据存储

# privacy_data_storage_body
source: Session data is stored on the CodeLight Server you connect to (self-hosted or public). You control where your data lives. Authentication keys are stored securely in your device's Keychain. Server URLs and connection settings are stored locally on your device.
zh_hans: 会话数据存储在你连接的 CodeLight 服务器上（自托管或公共）。你掌控数据的去向。认证密钥安全地保存在设备的钥匙串中。服务器地址和连接设置只保存在本机。

# privacy_encryption
source: End-to-End Encryption
zh_hans: 端到端加密

# privacy_encryption_body
source: Messages between your Mac and iPhone are designed to be end-to-end encrypted. The CodeLight Server acts as a zero-knowledge relay — it stores encrypted data without the ability to read it.
zh_hans: 你的 Mac 和 iPhone 之间的消息采用端到端加密设计。CodeLight 服务器作为零知识中继——它存储加密数据但无法读取内容。

# privacy_last_updated
source: Last updated: April 7, 2026
zh_hans: 最后更新：2026 年 4 月 7 日

# privacy_open_source
source: Open Source
zh_hans: 开源

# privacy_open_source_body
source: CodeLight is open source. You can review the complete source code at:
zh_hans: CodeLight 是开源项目，你可以在下面的地址查看完整源代码：

# privacy_overview
source: Overview
zh_hans: 概述

# privacy_overview_body
source: CodeLight is an open-source application that syncs Claude Code sessions between your Mac and iPhone. Your privacy is important to us.
zh_hans: CodeLight 是一款开源应用，用于在你的 Mac 与 iPhone 之间同步 Claude Code 会话。我们重视你的隐私。

source: Privacy Policy
zh_hans: 隐私政策

# privacy_push
source: Push Notifications
zh_hans: 推送通知

# privacy_push_body
source: If enabled, push notifications are delivered via Apple Push Notification Service (APNs). Device tokens are stored on the CodeLight Server you are connected to and are not shared with anyone else.
zh_hans: 如果启用，推送通知通过 Apple 推送通知服务（APNs）发送。设备令牌保存在你连接的 CodeLight 服务器上，不会与其他任何人共享。

# privacy_third_party
source: Third-Party Services
zh_hans: 第三方服务

# privacy_third_party_body
source: CodeLight does not use any analytics, tracking, or advertising services. No data is shared with third parties.
zh_hans: CodeLight 不使用任何统计分析、跟踪或广告服务。不会向任何第三方共享数据。

source: Push Notifications
zh_hans: 推送通知

# qr_outdated_codeisland
source: This QR is from an outdated CodeIsland — please update your Mac app
zh_hans: 二维码格式过旧，请升级你的 CodeIsland Mac 应用

source: Quit Now
zh_hans: 立即退出

source: Recent
zh_hans: 最近

source: Recent Projects
zh_hans: 最近项目

source: Reconnect
zh_hans: 重新连接

source: Reconnect failed
zh_hans: 重新连接失败

# reconnect_footer
source: Disconnect and reconnect to the current server. Use this if sync feels out of date.
zh_hans: 断开并重新连接当前服务器。如果同步感觉不同步时可用此操作。

# reconnected_success
source: Reconnected
zh_hans: 已重新连接

source: Reconnecting...
zh_hans: 重新连接中...

# reconnecting_ellipsis
source: Reconnecting…
zh_hans: 正在重新连接…

# redeem_already_used
source: You have already used this code.
zh_hans: 你已经使用过此兑换码。

# redeem_code_button
source: Have a redeem code?
zh_hans: 有兑换码？

# redeem_exhausted
source: This code has been fully redeemed.
zh_hans: 此兑换码已被全部使用。

# redeem_expired
source: This code has expired.
zh_hans: 此兑换码已过期。

# redeem_failed
source: Redeem failed. Please try again.
zh_hans: 兑换失败，请重试。

# redeem_invalid
source: Invalid redeem code.
zh_hans: 兑换码无效。

# redeem_network_error
source: Network error. Please check connection.
zh_hans: 网络错误，请检查连接。

# redeem_no_auth
source: Authentication required. Please reconnect.
zh_hans: 需要认证，请重新连接。

# redeem_no_server
source: Not connected to a server.
zh_hans: 未连接服务器。

# redeem_placeholder
source: Enter redeem code
zh_hans: 输入兑换码

# redeem_submit
source: Redeem
zh_hans: 兑换

source: Refresh
zh_hans: 刷新

source: Rename
zh_hans: 重命名

# rename_footer
source: Stored locally on this iPhone. Other devices won't see your custom name.
zh_hans: 保存在本机。其他设备看不到你的自定义名称。

# rename_session
source: Session Name
zh_hans: 会话名称

source: Reset
zh_hans: 重置

# reset_backend
source: Reset
zh_hans: 重置

# reset_backend_confirm
source: This will unpair all Macs and clear all server data. Continue?
zh_hans: 这将解除所有 Mac 的配对并清空服务器数据，是否继续？

source: Reset Connection
zh_hans: 重置连接

# reset_footer
source: Remove all paired Macs from this device and clear the saved server URL. You will need to pair again.
zh_hans: 从此设备删除所有已配对的 Mac 并清除已保存的服务器地址，需要重新配对。

# reset_to_default
source: Reset to default name
zh_hans: 恢复默认名称

source: Retry
zh_hans: 重试

# role_interrupted
source: Interrupted
zh_hans: 已中断

# role_thinking
source: Thinking
zh_hans: 思考中

# role_tool
source: Tool
zh_hans: 工具

# role_you
source: You
zh_hans: 你

source: Save
zh_hans: 保存

source: Scan New QR Code
zh_hans: 扫描新二维码

source: Scan QR
zh_hans: 扫描二维码

source: Scan QR Code
zh_hans: 扫描二维码

# scan_qr_instruction
source: Open CodeIsland on your Mac and scan the pairing QR code
zh_hans: 在 Mac 上打开 CodeIsland 然后扫描配对二维码

# scan_qr_on_mac
source: Scan the QR shown on your Mac
zh_hans: 扫描 Mac 上显示的二维码

source: Security
zh_hans: 安全

# send_status_delivered
source: Delivered to Mac
zh_hans: 已送达 Mac

# send_status_sending
source: Sending…
zh_hans: 发送中…

# send_status_thinking
source: Claude is thinking…
zh_hans: Claude 正在思考…

source: Server
zh_hans: 服务器

source: Server URL
zh_hans: 服务器 URL

source: Server URL required
zh_hans: 请输入服务器地址

source: Servers
zh_hans: 服务器

source: Session
zh_hans: 会话

source: Session Info
zh_hans: 会话信息

# session_name_placeholder
source: Custom name
zh_hans: 自定义名称

source: Session Not Found
zh_hans: 会话未找到

source: Settings
zh_hans: 设置

source: Status
zh_hans: 状态

# status_active
source: Active
zh_hans: 已激活

# status_expired
source: Expired
zh_hans: 已过期

# status_trial
source: Trial
zh_hans: 试用中

# status_unknown
source: Unknown
zh_hans: 未知

# step_install_codeisland
source: Install CodeIsland on your Mac
zh_hans: 在 Mac 上安装 CodeIsland

# step_sessions_appear
source: Sessions appear here automatically
zh_hans: 会话将自动显示在这里

# step_start_session
source: Start a Claude Code session
zh_hans: 启动一个 Claude Code 会话

# store_product_unavailable
source: Product is unavailable. Please try again later.
zh_hans: 产品暂不可用，请稍后再试。

# store_verification_failed
source: Transaction verification failed.
zh_hans: 交易验证失败。

# sub_already_purchased_subtitle
source: You have lifetime access to all Code Light features.
zh_hans: 你已拥有 Code Light 所有功能的终身使用权。

# sub_already_purchased_title
source: You're All Set!
zh_hans: 已解锁！

# sub_feat_island_desc
source: Live session status on your Lock Screen
zh_hans: 锁屏实时显示会话状态

# sub_feat_island_title
source: Dynamic Island
zh_hans: 灵动岛

# sub_feat_mac_desc
source: Connect one iPhone to multiple Macs
zh_hans: 一台 iPhone 连接多台 Mac

# sub_feat_mac_title
source: Multi-Mac Pairing
zh_hans: 多 Mac 配对

# sub_feat_sessions_desc
source: Monitor all Claude Code sessions in real time
zh_hans: 实时监控所有 Claude Code 会话

# sub_feat_sessions_title
source: Unlimited Sessions
zh_hans: 无限会话

# sub_feat_sync_desc
source: Messages, approvals, and commands from your phone
zh_hans: 消息、审批、指令，手机全搞定

# sub_feat_sync_title
source: Real-time Sync
zh_hans: 实时同步

# sub_feature_island
source: Dynamic Island
zh_hans: 灵动岛

# sub_feature_lifetime
source: Lifetime access
zh_hans: 终身使用权

# sub_feature_multi_mac
source: Multi-Mac pairing
zh_hans: 多 Mac 配对

# sub_feature_sessions
source: Unlimited sessions
zh_hans: 无限会话

# sub_feature_sync
source: Real-time sync
zh_hans: 实时同步

# sub_one_time_forever
source: one-time · yours forever
zh_hans: 一次购买 · 终身使用

# sub_pending_server
source: Purchased, connecting...
zh_hans: 已购买，连接服务器中...

# sub_purchasing
source: Purchasing...
zh_hans: 购买中...

# sub_restore_no_purchase
source: No previous purchase found.
zh_hans: 未找到之前的购买记录。

# sub_restore_purchase
source: Restore Purchase
zh_hans: 恢复购买

# sub_subscription_required_subtitle
source: Subscribe to continue using Code Light's server features.
zh_hans: 订阅后才能使用 Code Light 的服务器转发功能。

# sub_subscription_required_title
source: Subscription Required
zh_hans: 需要订阅

# sub_success
source: Unlocked!
zh_hans: 已解锁！

# sub_terms
source: Terms of Use
zh_hans: 使用条款

# sub_trial_ended_subtitle
source: Upgrade to keep using Code Light with your Mac.
zh_hans: 升级以继续使用 Code Light 连接你的 Mac。

# sub_trial_ended_title
source: Your Trial Has Ended
zh_hans: 试用已到期

# sub_unlock_button
source: Unlock Code Light
zh_hans: 解锁 Code Light

# sub_unlock_subtitle
source: Get lifetime access to all features.
zh_hans: 终身解锁所有功能。

# sub_unlock_title
source: Unlock Code Light
zh_hans: 解锁 Code Light

# sub_verifying
source: Verifying...
zh_hans: 验证中...

source: Subscription
zh_hans: 订阅

# subscription_footer
source: A lifetime purchase unlocks all features on this server.
zh_hans: 终身买断解锁此服务器的所有功能。

# subscription_required_banner
source: Subscription required to use server features
zh_hans: 需要订阅才能使用服务器功能

# swipe_to_unpair
source: Swipe a Mac to unpair
zh_hans: 左滑以解除配对

# tab_active
source: Active
zh_hans: 活跃

# tab_archived
source: Archived
zh_hans: 归档

# tab_recent
source: Recent
zh_hans: 最近

source: Take Photo
zh_hans: 拍照

# tap_plus_to_launch
source: Tap + to launch a new session on this Mac
zh_hans: 点击右上角加号，在这台 Mac 上启动新会话

# tap_plus_to_pair
source: Tap + to pair a Mac
zh_hans: 点击加号配对一台 Mac

# tap_server_to_switch
source: Tap a server to switch the active connection
zh_hans: 点击服务器可切换当前连接

source: Tap to switch server
zh_hans: 点击切换服务器

# thinking_ellipsis
source: Thinking...
zh_hans: 思考中...

source: Token Expiry
zh_hans: 令牌有效期

# token_expiry_footer
source: Controls how long your authentication token remains valid before you need to re-authenticate.
zh_hans: 控制认证令牌多久失效并需要重新验证。

# trial_days_left_format
source: Trial (%lld days left)
zh_hans: 试用中（剩余 %lld 天）

source: Try Again
zh_hans: 重试

source: Unarchive
zh_hans: 取消归档

source: Unpair
zh_hans: 解除配对

source: Upgrade
zh_hans: 升级

source: Upgrade to Lifetime
zh_hans: 升级为终身版

source: Version
zh_hans: 版本
